app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Life is Beautiful"], ["rating", "G"], ["release_date", "2015-11-28 00:00:00.000000"], ["created_at", "2015-11-28 20:03:16.457469"], ["updated_at", "2015-11-28 20:03:16.457469"]]
---
  def create
    params.permit!
    @movie = Movie.new(params[:movie])
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Star Wars: The Force Awakens"], ["rating", "PG"], ["release_date", "2015-12-18 00:00:00.000000"], ["updated_at", "2016-01-14 02:03:01.118976"], ["id", 24]]
---
  def update
    params.permit!
    @movie = Movie.find params[:id]
    if @movie.update_attributes(params[:movie])