app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("potatoes", "movie_id", "moviegoer_id") VALUES (?, ?, ?)  [["potatoes", 5], ["movie_id", 9], ["moviegoer_id", 1]]
---
  def create
    # since moviegoer_id is a protected attribute that won't get
    # assigned by the mass-assignment from params[:review], we set it
    # by using the << method on the association.  We could also
    # set it manually with review.moviegoer = @current_user.
    @current_user.reviews << @movie.reviews.build(params[:review])