app/controllers/sessions_controller.rb

INSERT INTO "moviegoers" ("provider", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["provider", "twitter"], ["uid", "351037387"], ["name", "Dan Cal"], ["created_at", "2016-01-14 09:58:45.077641"], ["updated_at", "2016-01-14 09:58:45.077641"]]
SELECT  "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."provider" = ? AND "moviegoers"."uid" = ? LIMIT 1  [["provider", "twitter"], ["uid", "351037387"]]
---
  def create
    auth=request.env["omniauth.auth"]
    user=Moviegoer.find_by_provider_and_uid(auth["provider"],auth["uid"]) ||
      Moviegoer.create_with_omniauth(auth)